{
  "plugins": {
    "FixCursorHold.nvim": [],
    "blink.cmp": {
      "version": "'v1.7.0'"
    },
    "friendly-snippets": [],
    "harpoon": {
      "version": "'harpoon2'"
    },
    "knap": {
      "src": "https://github.com/frabjous/knap"
    },
    "ltex_extra.nvim": {
      "src": "https://github.com/barreiroleo/ltex_extra.nvim",
      "version": "'dev'"
    },
    "markdown-preview.nvim": {
      "src": "https://github.com/iamcco/markdown-preview.nvim"
    },
    "mason-lspconfig.nvim": {
    },
    "mason.nvim": {
    },
    "neotest": {
    },
    "neotest-gtest": [],
    "neotest-java": {
    },
    "nvim-dap": {
    },
    "nvim-dap-ui": [],
    "nvim-dap-virtual-text": [],
    "nvim-jdtls": {
    },
    "nvim-lspconfig": {
    },
    "nvim-nio": [],
    "nvim-treesitter": [],
    "oil.nvim": {
    },
    "plenary.nvim": [],
    "telescope-fzf-native.nvim": [],
    "telescope.nvim": {
    },
    "term-edit.nvim": {
      "version": "'v1.4.0'"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive"
    },
    "vim-polar": [],
    "vimtex": {
      "src": "https://github.com/lervag/vimtex"
    }
  }
}